{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "anger",
    "1": "depressed",
    "2": "disappointment",
    "3": "disgust",
    "4": "embarrassment",
    "5": "fear",
    "6": "grief",
    "7": "hopeless",
    "8": "lonely",
    "9": "nervousness",
    "10": "neutral",
    "11": "remorse",
    "12": "sadness",
    "13": "suicidal"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "anger": 0,
    "depressed": 1,
    "disappointment": 2,
    "disgust": 3,
    "embarrassment": 4,
    "fear": 5,
    "grief": 6,
    "hopeless": 7,
    "lonely": 8,
    "nervousness": 9,
    "neutral": 10,
    "remorse": 11,
    "sadness": 12,
    "suicidal": 13
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 130,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 30000
}
